In [2]:
import pandas as pd

Series is one of basic dtypes in pandas. It holds one dimensional array of any dtype (Even functions like sum)

In [9]:
pd.Series([1, 'a', 3j])

0     1
1     a
2    3j
dtype: object

In [19]:
S1 = pd.Series(list(range(1,5)), ['A' ,'B', 'C', 'D']) # data, 
S1

A    1
B    2
C    3
D    4
dtype: int64

In [20]:
S2 = pd.Series({'A': 1, 'B': 2, 'C': 3, })
S2

A    1
B    2
C    3
dtype: int64

In [21]:
S1*S2 # +, - *, can be done

A    1.0
B    4.0
C    9.0
D    NaN
dtype: float64

Dataframe is very similar to excel

In [22]:
from numpy.random import randn
import numpy as np

np.random.seed(101)

df = pd.DataFrame(randn(4,4), ['A', 'B', 'C', 'D'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [24]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [28]:
type(df['W']) # a dataframe column is basically a series

pandas.core.series.Series

In [29]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [30]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057

In [31]:
df['WY'] = df['W'] + df['X']

In [32]:
df['WY']

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
Name: WY, dtype: float64

In [33]:
df

          W         X         Y         Z        WY
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177

In [37]:
df.drop('WY', axis=1) # just returns df without WY, use inplace=True to actually remove

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [38]:
df

          W         X         Y         Z        WY
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177

In [39]:
df.drop('WY', axis=1, inplace= True)

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

Fetching Rows

In [43]:
df.loc['C'] # loc is for col name

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
df.iloc[2] # iloc is for index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [45]:
df.loc['B', 'Y']

-0.8480769834036315

In [48]:
df.loc[['A', 'B'], ['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

Queries

In [52]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [53]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [54]:
df['W'] > 0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [56]:
df[df['W'] > 0] # fetch all the rows in the df where W column has a value greater than 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [57]:
df[(df['W'] > 0) & (df['Z'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [58]:
df.reset_index() # again use inplace = True for permanant change

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [61]:
df['States'] = 'MD NY VA PA'.split()

In [62]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     MD
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     VA
D  0.188695 -0.758872 -0.933237  0.955057     PA

In [63]:
df.set_index('States')

               W         X         Y         Z
States
MD      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
VA     -2.018168  0.740122  0.528813 -0.589001
PA      0.188695 -0.758872 -0.933237  0.955057